ТОИР_демо/src/Documents/торо_ВводНачальныхДанных/торо_ВводНачальныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВводНачальныхДанных</name>
  <registerRecords>InformationRegister.торо_ТекущееСостояниеОР</registerRecords>
  <registerRecords>AccumulationRegister.торо_НаработкаОбъектовРемонта</registerRecords>
  <registerRecords>AccumulationRegister.торо_КоличествоПусковОР</registerRecords>
  <registerRecords>InformationRegister.торо_ПериодыНаработкиОР</registerRecords>
  <registerRecords>InformationRegister.торо_ЗначенияКонтролируемыхПоказателей</registerRecords>
  <registerRecords>InformationRegister.торо_ЗавершенныеМероприятия</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОстановленноеОборудование</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОборудованиеНаИспытаниях</registerRecords>
  <registerRecords>InformationRegister.торо_ЗавершенныеРемонтныеРаботы</registerRecords>
  <registerRecords>InformationRegister.торо_ИсторияЗапчастейОбъектаРемонта</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыДокументаВводНачДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ремонты</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Ремонт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнегоРемонта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаПриРемонте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееСостояние</name>
      <type>
        <types>CatalogRef.торо_ВидыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаПростоя</name>
      <type>
        <types>CatalogRef.торо_ПричиныПростояОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзменятьСостояниеПодчиненныхОР</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаработкаОбъектыРемонта</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыС</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРаботыПо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиОбъектыРемонта</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтроля</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗапчастиОбъектаРемонта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДвиженияЗЧ</name>
      <type>
        <types>EnumRef.торо_ВидыДвиженияСерийныхЗЧ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РегламентныеМероприятия</name>
    <attributes>
      <name>СписокОбъектов</name>
      <type>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМероприятия</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнегоМероприятия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СпискиОбъектовРемонта</name>
    <attributes>
      <name>СписокОбъектов</name>
      <type>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПускиОР</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПуска</name>
      <type>
        <types>CatalogRef.торо_ВидыПусковОР</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/AccumulationRegisters/торо_НаработкаОбъектовРемонта/торо_НаработкаОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_НаработкаОбъектовРемонта</name>
  <resources>
    <name>Наработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьДатаКон</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ТОИР_демо/src/InformationRegisters/торо_ПериодыНаработкиОР/торо_ПериодыНаработкиОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПериодыНаработкиОР</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ЗначенияКонтролируемыхПоказателей/торо_ЗначенияКонтролируемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗначенияКонтролируемыхПоказателей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ИсторияЗапчастейОбъектаРемонта/торо_ИсторияЗапчастейОбъектаРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИсторияЗапчастейОбъектаРемонта</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Установлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Запчасть</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДвиженияЗЧ</name>
    <type>
      <types>EnumRef.торо_ВидыДвиженияСерийныхЗЧ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/AccumulationRegisters/торо_КоличествоПусковОР/торо_КоличествоПусковОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_КоличествоПусковОР</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПуска</name>
    <type>
      <types>CatalogRef.торо_ВидыПусковОР</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ТОИР_демо/src/InformationRegisters/торо_ТекущееСостояниеОР/торо_ТекущееСостояниеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ТекущееСостояниеОР</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидЭксплуатации</name>
    <type>
      <types>CatalogRef.торо_ВидыЭксплуатации</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаПростоя</name>
    <type>
      <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/AccumulationRegisters/торо_ОборудованиеНаИспытаниях/торо_ОборудованиеНаИспытаниях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ОборудованиеНаИспытаниях</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ТОИР_демо/src/Documents/торо_ВводНачальныхДанных/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

Перем мТаблицаОбъектовРемонта;
Перем ТаблицаИерархии;
Перем СписокПодчиненныхОбъектов;

Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ВидОперации = Перечисления.торо_ВидыДокументаВводНачДанных.ПоОбъектуРемонта Тогда
		Если ОбъектыРемонта.Количество() = 0 Тогда
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В документе не заполнена табличная часть объектов ремонта. Проведение невозможно!'"));
			Отказ = истина;
			Возврат;
		КонецЕсли;
	Иначе
		Если СпискиОбъектовРемонта.Количество() = 0 Тогда
			торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В документе не заполнена табличная часть списка объектов ремонта. Проведение невозможно!'"));
			Отказ = истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = Строка(Ссылка);
	
	Движения.торо_ЗавершенныеРемонтныеРаботы.Записывать = Истина;
	Для Каждого Работа Из ВыполненныеРаботы Цикл 
		Движение = Движения.торо_ЗавершенныеРемонтныеРаботы.Добавить();
		Движение.ВидРемонтныхРабот = Работа.ВидРемонтныхРабот;
		Движение.ОбъектРемонта = Работа.ОбъектРемонта;
		Движение.Период = Работа.ДатаОкончанияРемонта;
		Движение.ID = Новый УникальныйИдентификатор;
		Движение.ДатаОкончания = Работа.ДатаОкончанияРемонта;
	КонецЦикла;
	
	Движения.торо_НаработкаОбъектовРемонта.Записывать = Истина;
	Движения.торо_ПериодыНаработкиОР.Записывать = Истина;
	Для Каждого Наработка Из НаработкаОбъектыРемонта Цикл 
		Движение=Движения.торо_НаработкаОбъектовРемонта.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ДатаКон = Наработка.ДатаРаботыПо;
		Движение.ДатаНач = Наработка.ДатаРаботыС;
		Движение.Наработка = Наработка.Значение;
		Движение.ОбъектРемонта = Наработка.ОбъектРемонта;
		Движение.Показатель = Наработка.Показатель;
		Движение.Период = Наработка.ДатаРаботыПо;
		
		Движение = Движения.торо_ПериодыНаработкиОР.Добавить();
		Движение.Период = Наработка.ДатаРаботыПо;
		Движение.ОбъектРемонта = Наработка.ОбъектРемонта;
		Движение.Показатель = Наработка.Показатель;
	КонецЦикла;
	
	Движения.торо_ЗначенияКонтролируемыхПоказателей.Записывать = Истина;
	Для Каждого Показатель Из ПоказателиОбъектыРемонта Цикл 
		Движение=Движения.торо_ЗначенияКонтролируемыхПоказателей.Добавить();
		Движение.ДатаКонтроля = Показатель.ДатаКонтроля;
		Движение.Значение = Показатель.Значение;
		Движение.ОбъектРемонта = Показатель.ОбъектРемонта;
		Движение.Показатель = Показатель.Показатель;
		Движение.Период = Дата;
	КонецЦикла;
	
	Движения.торо_ИсторияЗапчастейОбъектаРемонта.Записывать = Истина;
	Для каждого Запчасть из ЗапчастиОбъектаРемонта Цикл
		Движение=Движения.торо_ИсторияЗапчастейОбъектаРемонта.Добавить();
		Движение.Запчасть = Запчасть.Номенклатура;
		Движение.ОбъектРемонта = Запчасть.ОбъектРемонта;
		Движение.СерийныйНомер = Запчасть.СерийныйНомер;
		Движение.Период = Дата;
		Движение.Количество = ?(ЗначениеЗаполнено(Запчасть.Количество) И Не ЗначениеЗаполнено(Запчасть.СерийныйНомер) ,Запчасть.Количество,1);
		Движение.СтатусДвиженияЗЧ = Запчасть.СтатусДвиженияЗЧ;
		Движение.Установлена = Истина;
	КонецЦикла;
	
	Движения.торо_КоличествоПусковОР.Записывать = Истина;
	Для каждого Пуск из ПускиОР Цикл
		Движение=Движения.торо_КоличествоПусковОР.Добавить();
		Движение.ОбъектРемонта = Пуск.ОбъектРемонта;
		Движение.ВидПуска = Пуск.ВидПуска;
		Движение.Количество = Пуск.Количество;
		Движение.Период = Дата;
	КонецЦикла;
	
	Движения.торо_ТекущееСостояниеОР.Записывать = Истина;
	Движения.торо_ОстановленноеОборудование.Записывать = Истина;
	Движения.торо_ОборудованиеНаИспытаниях.Записывать = Истина;
	Для каждого ОбъектРемонта из мТаблицаОбъектовРемонта Цикл
		Если Не ОбъектРемонта.ОбъектРемонта.ЭтоГруппа Тогда
			Если ЗначениеЗаполнено(ОбъектРемонта.ТекущееСостояние) Тогда
				Движение=Движения.торо_ТекущееСостояниеОР.Добавить();
				Движение.ОбъектРемонта = ОбъектРемонта.ОбъектРемонта;
				Движение.ВидЭксплуатации = ОбъектРемонта.ТекущееСостояние;
				Движение.ПричинаПростоя = ОбъектРемонта.ПричинаПростоя;
				Движение.Период = ОбъектРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию;
				
				Если ОбъектРемонта.ТекущееСостояние.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Простой Тогда
					Движение=Движения.торо_ОстановленноеОборудование.Добавить();
					Движение.ОбъектРемонта 	= ОбъектРемонта.ОбъектРемонта;
					Движение.Количество 	= 1;
					Движение.Дата 			= ОбъектРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию;
					Движение.ПричинаПростоя = ОбъектРемонта.ПричинаПростоя;
					Движение.Период 		= ОбъектРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию;
					Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
				ИначеЕсли ОбъектРемонта.ТекущееСостояние.ТипЭксплуатации = Перечисления.торо_ТипЭксплуатации.Испытания Тогда
					Движение=Движения.торо_ОборудованиеНаИспытаниях.Добавить();
					Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
					Движение.ОбъектРемонта	= ОбъектРемонта.ОбъектРемонта;
					Движение.Период			= ОбъектРемонта.ОбъектРемонта.ДатаВводаВЭксплуатацию;
					Движение.Количество		= 1;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	// регламентные мероприятия +
	Движения.торо_ЗавершенныеМероприятия.Записывать = Истина;
	Для Каждого Работа Из РегламентныеМероприятия Цикл 
		Движение = Движения.торо_ЗавершенныеМероприятия.Добавить();
		Движение.СписокОбъектов = Работа.СписокОбъектов;
		Движение.ВидМероприятия = Работа.ВидМероприятия;
		Движение.Период = Работа.ДатаПоследнегоМероприятия;
		Движение.ID = Новый УникальныйИдентификатор;
		Движение.ДатаОкончания = Работа.ДатаПоследнегоМероприятия;
	КонецЦикла;
	// регламентные мероприятия -
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ПолучитьТаблицуОбъектовРемонта();
				
		ПроверитьНаНаличиеДокументовМеняющихСостоянияОР(Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьПодчиненныеОбъекты(ОбъектРемонта, Иерархия, ПолучатьТаблицуВходящих = Ложь)
	
	Если ПолучатьТаблицуВходящих Тогда
		
		ТаблицаИерархии.Очистить();
		
		СписокПодчиненныхОбъектов.Очистить();
		
		Запрос = Новый Запрос;
		
		Если Иерархия.ИзменяетсяДокументами Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РасположениеОРВСтруктуреИерархии.ОбъектИерархии,
			|	РасположениеОРВСтруктуреИерархии.РодительИерархии
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(&Дата, СтруктураИерархии = &Иерархия) КАК РасположениеОРВСтруктуреИерархии
			|ГДЕ
			|	НЕ РасположениеОРВСтруктуреИерархии.Удален";
			
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.УстановитьПараметр("Иерархия", Иерархия);
			
		Иначе
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии,
			|	торо_ИерархическиеСтруктурыОР.РодительИерархии
			|ИЗ
			|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
			|ГДЕ
			|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &Иерархия";

			Запрос.УстановитьПараметр("Иерархия", Иерархия);

		КонецЕсли;
		
		ТаблицаИерархии = Запрос.Выполнить().Выгрузить();
	КонецЕсли;	
	
	МассивСтрокОР = ТаблицаИерархии.НайтиСтроки(Новый Структура("РодительИерархии", ОбъектРемонта));
	
	Если МассивСтрокОР.Количество() Тогда
		
		Для Каждого ЭлементМассиваОР Из МассивСтрокОР Цикл
			ПолучитьПодчиненныеОбъекты(ЭлементМассиваОР.ОбъектИерархии, Иерархия);
			Если ТипЗнч(ЭлементМассиваОР.ОбъектИерархии) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
				СписокПодчиненныхОбъектов.Добавить(ЭлементМассиваОР.ОбъектИерархии);
			КонецЕсли;
		КонецЦикла;	
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьТаблицуОбъектовРемонта()
	
	мТаблицаОбъектовРемонта.Очистить();
	Для каждого ТекСтрока из ОбъектыРемонта Цикл
		
		СтруктураПоиска = Новый Структура();
		
		СтруктураПоиска.Вставить("ОбъектРемонта",			ТекСтрока.ОбъектРемонта);
		
		НайденныеСтроки = мТаблицаОбъектовРемонта.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			мТаблицаОбъектовРемонта.Удалить(НайденнаяСтрока);
		КонецЦикла;		
		
		Если НЕ ТекСтрока.ИзменятьСостояниеПодчиненныхОР Тогда
			НС = мТаблицаОбъектовРемонта.Добавить();
			ЗаполнитьЗначенияСвойств(НС , ТекСтрока);
			
		Иначе
						
			НС = мТаблицаОбъектовРемонта.Добавить();
			ЗаполнитьЗначенияСвойств(НС , ТекСтрока);
			
			ПолучитьПодчиненныеОбъекты(ТекСтрока.ОбъектРемонта, ТекСтрока.Иерархия, Истина);
			
			Для Каждого ЭлементСписка Из СписокПодчиненныхОбъектов Цикл
				
				    СтруктураПоиска = Новый Структура();
					
					СтруктураПоиска.Вставить("ОбъектРемонта",			ЭлементСписка.Значение);
					
					Если мТаблицаОбъектовРемонта.НайтиСтроки(СтруктураПоиска).Количество() Тогда
						Продолжить;
					КонецЕсли;	
					
					НС = мТаблицаОбъектовРемонта.Добавить();
					
					ЗаполнитьЗначенияСвойств(НС , ТекСтрока);
					НС.ОбъектРемонта		 	= ЭлементСписка.Значение;
					
			КонецЦикла;	
 				
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьНаНаличиеДокументовМеняющихСостоянияОР(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбъектыРемонта.ОбъектРемонта,
	               |	ОбъектыРемонта.ТекущееСостояние
	               |ПОМЕСТИТЬ ОбъектыРемонта
	               |ИЗ
	               |	&ОбъектыРемонта КАК ОбъектыРемонта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Состояния.ОбъектРемонта,
	               |	Состояния.ТекущееСостояние
	               |ИЗ
	               |	ОбъектыРемонта КАК Состояния
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущееСостояниеОР КАК торо_ТекущееСостояниеОР
	               |		ПО Состояния.ОбъектРемонта = торо_ТекущееСостояниеОР.ОбъектРемонта
	               |ГДЕ
	               |	торо_ТекущееСостояниеОР.Регистратор <> &Ссылка";
	Запрос.УстановитьПараметр("ОбъектыРемонта", мТаблицаОбъектовРемонта);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ТаблицаНеверныхСтрокТЧ = Запрос.Выполнить().Выгрузить();
	ТаблицаНеверныхСтрокТЧ.Свернуть("ОбъектРемонта, ТекущееСостояние");
	
	Если ТаблицаНеверныхСтрокТЧ.Количество() > 0 Тогда

		Для Каждого Строка Из ТаблицаНеверныхСтрокТЧ Цикл
			Если ЗначениеЗаполнено(Строка.ТекущееСостояние) Тогда
				торо_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Для объекта ремонта %1 уже имеются документы меняющие состояния объекта!'"),Строка.ОбъектРемонта));
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
						
	КонецЕсли;
	
КонецПроцедуры

мТаблицаОбъектовРемонта = ОбъектыРемонта.ВыгрузитьКолонки();

ТаблицаИерархии = Новый ТаблицаЗначений;
СписокПодчиненныхОбъектов = Новый СписокЗначений;

#КонецОбласти

#КонецЕсли
